---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FlexPipe.FlexPipeType
source: html/5b7ab8d0-bd8d-f834-5d2e-a2504d3a91ce.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipe.FlexPipeType Property

The flex pipe type of this flex pipe.

## Syntax (C#)
```csharp
public FlexPipeType FlexPipeType { get; set; }
```